app/Models/LogModel.php

    public function addLog(string $action, string $type = '')
    {
    date_default_timezone_set('Asia/Manila'); // Set to Philippine time

    $session = session();
    $this->insert([
        'USERID'          => $session->get('user_id'),
        'USER_NAME'       => $session->get('name'),
        'ACTION'          => $action,
        'DATELOG'         => date('Y-m-d'),
        'TIMELOG'         => date('H:i:s'),
        'user_ip_address' => $_SERVER['REMOTE_ADDR'] ?? 'unknown',
        'device_used'     => $_SERVER['HTTP_USER_AGENT'] ?? 'unknown',
        'identifier'      => $type
    ]);
---
INSERT INTO `tbl_logs` (`USERID`, `USER_NAME`, `ACTION`, `DATELOG`, `TIMELOG`, `user_ip_address`, `device_used`, `identifier`) VALUES ('1', 'Glenn Azuelo', 'Login: Glenn Azuelo', '2026-02-09', '09:44:16', '::1', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/127.0.0.0 Safari/537.36', 'LOGIN')